/*
描述
大家都知道阶乘这个概念，举个简单的例子：5！=1*2*3*4*5.现在我们引入一种新的阶乘概念，将原来的每个数相乘变为i不大于n的所有奇数相乘例如：5!!=1*3*5.现在明白现在这种阶乘的意思了吧！
现在你的任务是求出1!!+2!!......+n!!的正确值(n<=20)
输入
第一行输入一个a(a<=20)，代表共有a组测试数据
接下来a行各行输入一个n.
输出
各行输出结果一个整数R表示1!!+2!!......+n!!的正确值
样例输入
2
3
5
样例输出
5
23
*/

# include <stdio.h>

int main()
{
	int n;
	scanf("%d",&n);
	while(n--)
	{
		int i;
		scanf("%d",&i);
		long sum = 1;
		long sum1 = 0;
		for(int j = 1; j <= i; j++)
		{
			for(int q = 1; q <= j; q++)
			{
				if(q%2 != 0)
				{
					sum *= q;
				}
			}
			sum1 += sum;
			sum = 1;
		}
		printf("%ld\n",sum1);
	}

	return 0;
}