/*
描述
很多小学生在学习加法时，发现“进位”特别容易出错。你的任务是计算两个三位数在相加时需要多少次进位。你编制的程序应当可以连续处理多组数据，直到读到两个0（这是输入结束标记）。
输入
输入两个正整数m,n.(m,n,都是三位数)
输出
输出m,n,相加时需要进位多少次。
样例输入
123 456
555 555
123 594
0 0
样例输出
0
3 
1
*/

#include <stdio.h>
int main()
{
	int a1, a2;
	while(scanf("%d%d", &a1, &a2) == 2)
	{
		int count =0, i = 0;
		if(!a1 && !a2) 
			break;
		if((a1%10 + a2%10)>9)
			count++;
		if((a1/10%10 + a2/10%10 + count)>9) 
			count++;
		i++;
		if((a1/100 + a2/100+i)>9)
			count++;
		printf("%d\n",count);
	}
	return 0;
}